// miniprogram/pages/swiper_detail_1/swiper_detail_1.js
Page({

  /**
   * 页面的初始数据
   */
  data: {
    picurl:"https://cdn.akamai.steamstatic.com/steam/apps/275850/header_alt_assets_1.jpg?t=1622639949",
    time:"2021-06-04",
    title:"无人深空 x 质量效应！",
    content_1:"你好，上周无人深空社区在新的滩头探险队中合作，解决了隐藏和加密目标的难题。 今天是一个可爱的时刻，因为探险家们发现在这个谜团的最后是来自质量效应的传奇 SSV Normandy SR1 的出现！关于这次神秘航行将通往何处的疯狂猜测。 非常感谢参与其中的热心旅行者：他们发现了“历史剂量计”的用途以及如何使用它； 那些破解密码并翻译隐藏在秘密字母表中的信息的人； 那些用遍布整个宇宙的巨石上的熔剂碎片拼凑出诺曼底登陆的故事的人； 以及所有参与巨大研究工作以解锁神话信标并召唤“武器”的人！ ",
    content_2:"这是一个可爱的小复活节彩蛋时刻，希望没有人期待我们对 BioWare 和 EA 让我们以这种方式表达敬意感到兴奋和受宠若惊。 作为该系列的忠实粉丝，对于科幻迷来说，这是一个美好的时刻。 像其他人一样，我们一直在通过传奇版的发布重新发现质量效应的惊人世界。 每次看到这艘令人难以置信的标志性飞船翘曲时，我仍然不寒而栗，很高兴看到这么多人有同样的反应。如果他们希望最终添加 SSV，现在所有玩家都必须在 5 月 31 日之前为自己进行这次探险 诺曼底 SR1 永久加入他们的护卫舰舰队。",
  },

  
  /**
   * 生命周期函数--监听页面加载
   */
  onLoad: function (options) {

  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady: function () {

  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow: function () {

  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide: function () {

  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload: function () {

  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh: function () {

  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom: function () {

  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage: function () {

  }
})