// miniprogram/pages/swiper_detail_1/swiper_detail_1.js
Page({

  /**
   * 页面的初始数据
   */
  data: {
    picurl:"https://cdn.akamai.steamstatic.com/steam/apps/1238810/header.jpg?t=1615895305",
    time:"2021-06-07",
    title:"Battlefield V 更新了！",
    content_1:"嘿伙计，我们上次谈话已经有一段时间了！在 EA DICE 的每个人都希望你们都保持良好状态，并且在我们进入假期时都身体健康。很高兴看到你们中的许多人在整个夏天都在我们所有的战地游戏中填充服务器，我们很高兴地说，明天我们将发布战地 V 的秋季更新，并兑现我们的承诺，扩展社区游戏。我们在社区游戏的功能集中加入了大量的新选项，其中许多我们过去已经谈过。在我们明天发布更新后的一段时间内，您将能够为自己设置一个自定义命名的服务器，该服务器最能反映您想要玩的战地 V 风格。想要设置一些回归基础吗？选择可用于部署的武器类别。需要自我治疗，而治疗补给去创造更激烈的比赛？把它们都关掉。想要增加步兵和载具的重生率，以及更高的票数和回合计时器吗？轻松搞定！除了对游戏进行一些额外的更改和更新之外，我们还欢迎两位新精英加入花名册——乔纳森·麦克尼尔和齐格弗里德·阿尔布雷希特。上个月发布的 Battlefield V Definitive Edition 的所有者将自动解锁两者，否则可以使用 Company Coin 在军械库中解锁。保持安全，保持健康，发挥目标！弗里曼战地社区经理。推特：@PartWelsh ",
    content_2:"让我们来看看好东西！ 安装更新后，《战地风云 V》的所有所有者都可以为社区游戏设置新的配置。如果您以前从未使用过该功能，您可以在 Play -> Multiplayer -> Create Community Game 中找到它。 在您第一次进入此菜单时，我们会向您提供一些信息，以帮助您将社区游戏保持在一个安全、积极的地方，让您可以玩战地 V（如果您看到任何不符合这些标准的服务器，请务必 使用新的游戏工具报告服务器）。",
  },

  
  /**
   * 生命周期函数--监听页面加载
   */
  onLoad: function (options) {

  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady: function () {

  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow: function () {

  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide: function () {

  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload: function () {

  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh: function () {

  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom: function () {

  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage: function () {

  }
})