// miniprogram/pages/swiper_detail_1/swiper_detail_1.js
Page({

  /**
   * 页面的初始数据
   */
  data: {
    picurl:"https://cdn.akamai.steamstatic.com/steam/apps/105600/header.jpg?t=1590092560",
    time:"2021-06-04",
    title:"2021 年泰拉瑞亚之夏 - 看看有什么！",
    content_1:"亲爱的泰拉瑞亚人！当我们即将进入夏季月份时，我们想与每个人一起检查。 毕竟，现在是与一两个朋友一起玩新泰拉瑞亚游戏的最佳时间，然后是在轻松的夏季月份！我们会定期检查整个社区的有趣事件和发生的事情，所以你一定要继续关注！ 当然，如果您想更全面地了解开发团队的来龙去脉等等，您应该查看我们每月在泰拉瑞亚社区论坛上发布的游戏状态帖子（May 的链接如下）：泰拉瑞亚游戏状态 - 2021 年 5 月 ",
    content_2:"我们也很高兴地宣布将于太平洋标准时间 6 月 19 日中午 12 点开始一个有趣的 Discord Alliance 合作活动！为夏季主题艺术提交活动做好准备！在所有参与的联盟服务器中都会有一个通道供参与者提交他们的条目。规则很简单：创建夏季主题艺术，也可以融入您的社区主题。每个人都必须在太平洋标准时间 7 月 3 日中午 12 点之前提交他们的参赛作品。您只需要在一台服务器上提交您的条目。收到所有提交后，我们会将它们添加到 Google 表单中，并向所有参与社区的 Discord 服务器公开投票。投票也将持续一周。规则：• 您必须提交图像/GIF。• 它必须是您自己的原创作品。• 没有NSFW 提交。前 10 名投票的获胜者将分别赢得他们将从奖池中挑选的奖品。这些奖品的范围从免费一年的 Discord Nitro 到免费的游戏副本。我们的目标是获得一些乐趣并开始与其他大型社区合作开展有趣的协作活动。除了全球前 10 名获奖者将获得的奖品外，我们还将向来自泰拉瑞亚社区/服务器的前 5 名参赛者颁发奖品。在接下来的几周内，我们还将在泰拉瑞亚社区中宣布更多有趣的夏季活动，因此随着我们在泰拉瑞亚 10 年继续举办激动人心的社区庆祝活动，你会想要关注更多。如果您需要有关我们 Discord 联盟的更多信息，请查看：http://hyperurl.co/DiscordAlliance以下是目前参加本次夏季主题比赛的联盟服务器列表（在开始之前可能会有更多服务器加入）：超级世界盒、泰拉瑞亚、罗布洛克斯、幽灵行者、命运、永游传记、狂神域、口袋妖怪剑与盾、保护动物，如果您有兴趣，请单击上面的名称以查看这些惊人的服务器中的每一个对于初学者来说就是这样，但我们才刚刚开始热身。期待在 2021 年夏季听到更多有趣的泰拉瑞亚活动！",
  },

  
  /**
   * 生命周期函数--监听页面加载
   */
  onLoad: function (options) {

  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady: function () {

  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow: function () {

  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide: function () {

  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload: function () {

  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh: function () {

  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom: function () {

  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage: function () {

  }
})