#include<stdio.h>
#include<stdlib.h>
#include<time.h>
#include<string.h>
char s[5005];
int DNMD()
{
    long long int n,sum1=0,sum2=0,sum3=0,sum4=0,sum5=0,sum6=0;
    printf("输入你要购买的箱子数量(不能超过1*10^8):");
    scanf("%lld",&n);
    srand(time(NULL));
    printf("您获得以下物品：\n");
    for(int i=1; i<=n; i++)
    {
        int l=rand()*126%100001;
        if(l<=26)
        {
            printf("********************************************************************************************");
            printf("\n\n");
            printf("DNMD闸总，暗金，卧槽，WTAT FUCK???\n");
            sum6++;
            printf("\n");
            printf("********************************************************************************************\n");
        }
        else if(l>26&&l<=260)
        {
            printf("********************************************************************************************");
            printf("\n\n");
            printf("DNMD闸总，金啊，你妈就真爆啊\n");
            sum5++;
            printf("\n");
            printf("********************************************************************************************\n");
        }
        else if(l>260&&l<=650)
        {
            printf("隐秘级：赚了，不亏\n");
            sum4++;
        }
        else if(l>650&&l<=3200)
        {
            printf("保密级：MD,怎么shùo呢，我觉得还行\n");
            sum3++;
        }
        else if(l>3200&&l<=15980)
        {
            printf("受限级：炼金术师\n");
            sum2++;
        }
        else
        {
            printf("军规级：白给\n");
            sum1++;
        }
    }
    printf("********************************************************************************************");
    printf("\n\n");
    printf("白给%lld个,总计花费%lld元\n受限级（紫色）%lld个，总计花费%lld元\n保密级（粉色）%lld个，总计花费%lld元\n隐秘级（红色）%lld个，总计花费%lld元\n金%lld个，总计花费%lld元\n暗金%lld个，总计花费%lld元\n",sum1,sum1*17,sum2,sum2*17,sum3,sum3*17,sum4,sum4*17,sum5,sum5*17,sum6,sum6*17);
    printf("\n");
    printf("********************************************************************************************\n\n");
}
int main()
{
    printf("说明：\n此程序完全依据完美世界所公布的爆率所写，绝对公平！！！\n军规级：蓝\n受限级：紫\n保密级：粉\n隐秘级：红\n其他的都是金，当有金爆出时，会有横线隔开（用来醒目）。\n");
    printf("是否要开箱？，是选1，否选0\n");
    scanf("%s",s);
    while(strlen(s)>1||(s[0]!='1'&&s[0]!='0'))
    {
        printf("请重新输入,是选1，否选0\n");
        scanf("%s",s);
    }
    while(s[0]=='1')
    {
        DNMD();
        printf("还tm开么？    是选1，否选0\n");
        scanf("%s",s);
        while(strlen(s)>1||(s[0]!='1'&&s[0]!='0'))
        {
            printf("请重新输入,是选1，否选0\n");
            scanf("%s",s);
        }
    }
    if(s[0]=='0')
    {
        printf("年轻人终于开窍了！！！\n");
        system("pause");
    }
}
