// miniprogram/pages/swiper_detail_1/swiper_detail_1.js
Page({

  /**
   * 页面的初始数据
   */
  data: {
    picurl:"https://cdn.akamai.steamstatic.com/steam/apps/730/header.jpg?t=1612812939",
    time:"2021-06-04",
    title:"对非优先账户的调整！",
    content_1:"从两年多以前CS:GO免费起，玩家人数日益壮大。 我们一直看到有新玩家涌入CS:GO。世界上任何人都可以免费体验CS:GO，这一点非常重要。我们除了提供免费的玩法外，新玩家还能获得掉落物品、经验等级和段位，并免费参与优先权匹配。 不幸的是，随着时间的推移，上述功能已经成为不良玩家损害新老玩家游戏体验的诱因。 因此，今天我们决定改变新玩家的游戏体验。新玩家仍然可以玩每一种游戏模式，包括在社区服务器和创意工坊地图上游玩。 但他们将不再获得经验值、排名、掉落物品和段位，这些功能现在起仅限于优先状态玩家。新玩家仍可以通过蒸汽平台商店购买升级成为优先账户（国服玩家请前往https://store.steamchina.com/sub/54029 购买），不再有免费升级途径。 如果非优先玩家在接下来的两周内购买优先状态，你当前的段位和等级进度将保留继承。 ",
    content_2:"关于“无级匹配”当新玩家游玩竞技模式、搭档模式和头号特训时，他们的比赛仍基于段位匹配，只是无法获得段位、经验等级等。优先玩家也可以参加“无级匹配”，他们的段位不会受到影响，并且没有游戏大厅的段位排位的组队限制。不管你是老玩家还是萌新，祝你好运，玩得开心！接下来是今天的更新日志",
  },

  
  /**
   * 生命周期函数--监听页面加载
   */
  onLoad: function (options) {

  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady: function () {

  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow: function () {

  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide: function () {

  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload: function () {

  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh: function () {

  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom: function () {

  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage: function () {

  }
})